# Exam_02_02. Некорректная работа программы №2 

## Задание

| Exam_02_02 | |
| ------ | ------ |
| Уровень: | 1 |
| Темы: | Ввод/вывод данных. |
| Директория для решения: | src/ |
| Файлы решения: | main.c |
| Входные данные: | Стандартный поток ввода (stdin) |
| Выходные данные: | Стандартный поток вывода (stdout) |

Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. В конце ответа не должно быть переноса на новую строку.

```c
#include <stdio.h>

int main(void)
{
    int x = -21;

    scanf("%d", x);
    printf("%03d", x);

    return 0;
}
```

## Примеры

| Входные данные | Результат работы |
| ------ | ------ |
| 0 | 00000 |
| 1 | 00001 |
| -12 | -0012 |
| 55555 | 55555 |

> **Внимание:** Мы любезно напоминаем вам, что процедура тестирования вашей программы включает анализ стиля кода. Пожалуйста, загляните в папку "materials/". Также обязательно проверяйте вашу программу на утечки памяти!
