# Exam_01_01. Исправление ошибок №1

## Задание

| Exam_01_01 | |
| ------ | ------ |
| Уровень: | 1 |
| Темы: | Базовые типы данных, объявление переменных, оператор присваивания. |
| Директория для решения: | src/ |
| Файлы решения: | main.c |
| Входные данные: | Стандартный поток ввода (stdin) |
| Выходные данные: | Стандартный поток вывода (stdout) |

При написании программы была допущена ошибка. Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. В конце ответа не должно быть переноса на новую строку.

```c
#include <stdio.h>

int main(void)
{
	INT a, b;
	a = b = 1;

	scanf("%d %d", &a, &b);
	printf("%d", a * b);

	return 0;
}
```

## Примеры

| Входные данные | Результат работы |
| ------ | ------ |
| 2 2 | 4 |
| -4 4 | -16 |

> **Внимание:** Мы любезно напоминаем вам, что процедура тестирования вашей программы включает анализ стиля кода. Пожалуйста, загляните в папку "materials/". Также обязательно проверяйте вашу программу на утечки памяти!
